Repository: MahmoudNabil14/ToDo
Catalog: lib/languages/app_*.arb
Languages: ar

source: New Tasks
ar: المهام الجديدة

source: Done Tasks
ar: المهام المنتهية

source: Postponed Tasks
ar: المهام المؤجلة

# newTasksFallback
source: You have no new tasks
ar: ليس لديك مهام جديدة

# doneTasksFallback
source: You haven't done any tasks yet
ar: لم تقم بأي مهام حتى الآن

# postponedTasksFallback
source: You have no postponed tasks
ar: ليس لديك مهام مؤجلة

# newTaskAddedToast
source: New task added
ar: تم اضافة مهمة جديدة

# addTaskToolTip
source: Add Task
ar: اضافة مهمة

# editTaskToolTip
source: Edit Task
ar: تعديل مهمة

source: Dark Mode:
ar: الوضع المظلم:

source: Language:
ar: اللغة:

# taskTitleHint
source: Task Title
ar: عنوان المهمة

# taskTimeHint
source: Task Time
ar: وقت المهمة

# taskDateHint
source: Task Date
ar: تاريخ المهمة

# taskDescriptionHint
source: Task Description
ar: وصف المهمة

source: Alarm Sound:
ar: صوت المنبه:

# alarmSoundValue
source: Alarm 1
ar: منبه 1

# alarmSound1
source: Alarm 1
ar: منبه 1

# alarmSound2
source: Alarm 2
ar: منبه 2

# alarmSound3
source: Alarm 3
ar: منبه 3

# alarmSound4
source: Alarm 4
ar: منبه 4

# alarmSound5
source: Alarm 5
ar: منبه 5

# alarmSound6
source: Alarm 6
ar: منبه 6

# alarmSound7
source: Alarm 7
ar: منبه 7

# alarmSound8
source: Alarm 8
ar: منبه 8

# alarmSound9
source: Alarm 9
ar: منبه 9

# alarmSound10
source: Alarm 10
ar: منبه 10

# editSaveButton
source: SAVE
ar: حفظ

# taskDescriptionHintFallback1
source: THIS TASK HAS NO DESCRIPTION
ar: لا يوجد وصف لهذة المهمة

# taskDescriptionHintFallback2
source: Click on edit icon to add description
ar: اضغط على ايقونة التعديل لإضافة وصف

# deleteDialogBoxTitle
source: Confirm
ar: تأكيد

# deleteDialogBoxContent
source: Are you sure you want to delete this task?
ar: هل انت متأكد انك تريد حذف هذة المهمة ؟

# deleteAllTasksDialogBoxContent
source: Are you sure you want to delete all tasks (New tasks, Done tasks, Postponed tasks)?
ar: هل انت متأكد انك تريد حذف جميع المهام (المهام الجديدة ، المهام المنتهية ، المهام المؤجلة)؟

# deleteNewTasksDialogBoxContent
source: Are you sure you want to delete all new tasks ?
ar: هل انت متأكد انك تريد حذف جميع المهام الجديدة ؟

# deleteDoneTasksDialogBoxContent
source: Are you sure you want to delete all done tasks ?
ar: هل انت متأكد انك تريد حذف جميع المهام المنتهية ؟

# deletePostponedTasksDialogBoxContent
source: Are you sure you want to delete all Postponed tasks ?
ar: هل انت متأكد انك تريد حذف جميع المهام المؤجلة ؟

# deleteDialogBoxCancelButton
source: Cancel
ar: إلغاء

# deleteDialogBoxDeleteButton
source: Delete
ar: حذف

# drawerSettings
source: Settings
ar: الإعدادت

# drawerDeleteAllTasks
source: Delete All Tasks
ar: حذف جميع المهام

# drawerSupportTitle
source: Support
ar: الدعم

# drawerRate
source: Rate us
ar: قيمنا

# drawerHelp
source: Help
ar: مساعدة

# drawerShareWithFriends
source: Share With Friends
ar: شارك البرنامج مع اصدقائك

# doneIconButtonHint
source: Done
ar: انهاء

# doneIconButtonHint2
source: renew
ar: تجديد

# postponedIconButtonHint
source: Postpone
ar: تأجيل

# postponedIconButtonHint2
source: renew
ar: تجديد

# deleteTasksToast
source: All tasks have been deleted
ar: تم حذف جميع المهام

# deleteOneTaskToast
source: Task {taskTitle} have been deleted
ar: تم حذف المهمة {taskTitle}

# deleteNewTasksToast
source: All New tasks have been deleted
ar: تم حذف جميع المهام الجديدة

# deleteNewTasksButtonHint
source: Delete new tasks
ar: حذف جميع المهام الجديدة

# deleteDoneTasksToast
source: All Done tasks have been deleted
ar: تم حذف جميع المهام المنتهية

# deleteDoneTasksButtonHint
source: Delete done tasks
ar: حذف جميع المهام المنتهية

# deletePostponedTasksToast
source: All Postponed tasks have been deleted
ar: تم حذف جميع المهام المؤجلة

# deletePostponedTasksButtonHint
source: Delete postponed tasks
ar: حذف جميع المهام المؤجلة

# deleteTasksToastFallback
source: You don't have tasks to delete it
ar: ليس لديك مهام لتحذفها

# deleteNewTasksToastFallback
source: You don't have new tasks to delete it
ar: ليس لديك مهام جديدة لتحذفها

# deleteDoneTasksToastFallback
source: You don't have done tasks to delete it
ar: ليس لديك مهام منتهية لتحذفها

# deletePostponedTasksToastFallback
source: You don't have Postponed tasks to delete it
ar: ليس لديك مهام مؤجلة لتحذفها

# notificationTitle
source: It's task time
ar: حان وقت المهمة

# reminderNotificationTitle
source: You have upcoming task after 15 minutes
ar: لديك مهمة قادمة بعد {reminderValue} دقيقة

# layoutHelpDialogBody
source: - Click on '+' to add new task - Swipe task left to delete it - Click on empty box to mark task as done - Click on down-arrow box to mark task as archive
ar: - اضغط على علامة'+' لإضافة مهمة جديدة - اسحب المهمة لليمين لتحذفها - اضغط على الصندوق الفارغ لإنهاء المهمة - اضغط على صندوق السهم لإسفل لتأجيل المهمة

# datePassedDialogTitle
source: Set new date
ar: تعيين تاريخ جديد

# datePassedDialogConfirmButton
source: Set
ar: تعيين

# datePassedDialogContent
source: This task date had passed, you need to set a new date to it to be able to unarchive it
ar: انقضى تاريخ هذه المهمة ، يجب عليك تعيين تاريخ جديد لها حتى تتمكن من الغاء تأجيلها

# taskTitleValidateMsg
source: Title must not be empty
ar: يجب ألا يكون العنوان فارغًا

# taskTimeValidateMsg
source: Time must not be empty
ar: يجب ألا يكون الوقت فارغًا

# taskDateValidateMsg
source: Date must not be empty
ar: يجب ألا يكون التاريخ فارغًا
